"""
今日のテーマ
変数(Variables)について

今日は文字をめっちゃ打(う)ちます
タイピングの練習(れんしゅう)の成果(せいか)が発揮(はっき)される！
💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋💋
"""

# 前回やったこと
# 変数(へんすう)、四則演算(しそくえんざん)、print()関数


"""
変数
"""
# コンピューターは人間の数千倍とか数万倍とかで色々なことをすることができる
# まじで優秀なパートナー
# だがしかし！
# 弱点がある

# それは
# 「やったことをすぐ忘れてしまう！」
# ということ

# 覚えておいてほしいこと(データ)もたくさんある
# そんな時に使(つか)うのが変数(へんすう)
# 変数にデータを入れることでそのデータを覚えておくことができる！
# 変数の作り方の例
takahashi = "高橋先生"
t_nenrei = 16
yamada='山田のおじい'
y_nenrei=136
"""
ポイント2
=の前後(ぜんご)は１文字空けてもいいし空けなくてもいい
お好(この)みでどうぞ

ポイント3
変数に文字を入れたい場合(ばあい)は、"（ダブルクォーテーション）か'シングルクォーテーションを使(つか)おう
"""



# 問題その１
# 変数って何？
# ヒント：デ◯タを入れる箱
# 変数に入ってるデータはコンピュータが覚えておくことができる！

# 問題その２
# 変数を２つ作って
# １つ目には自分の貯金額(嘘でもOK)
# ２つ目には自分の名前(嘘でもOK)
# ヒント：貯金は数、自分の名前は文字

# 答えをここに書いてね


"""
print()関数
()の中に書いたものを表示(ひょうじ)することができるよ
"""

print("高橋先生素敵💋💋💋💋")
# 実行して確認してみよう！

TKG = "卵かけご飯"

# 問題
# print(TKG)
# とかくと何が表示される？


# コメントアウトしてみよう


# 問題
# さっき自分の名前を保存する変数作った
# print()関数とその変数を必ず使って自分の名前を表示してみよう！


# 問題
# さっき自分の名前を保存する変数作った
# print()関数とその変数を必ず使って自分の名前を表示してみよう！



# 問題
# 下の２つのprint()関数を使うと何が表示されるでしょう
suteki_na_sensei = "高橋先生素敵"
# print(suteki_na_sensei)
# print("suteki_na_sensei")

# 問題
# 間違えたら腕立て伏せ３万回
# 下の２つのprint()関数を使うと何が表示されるでしょう
shumi = "ゴキブリとお散歩"
# print(shumi)
# print("shumi")

"""
四則演算(しそくえんざん)

たしざんは+（shit+れ）
ひきざんは-（ほ）
かけざんは*（shit+け）
わりざんは/（め）

かけざんとわりざんだけ算数の時に使う記号と違う
"""

# 問題
# 何が表示されるでしょう
a = 2
b = 1
#print(5 + 5)
#print(5 + b)
#print(10-5)
#print(a-b)
#print(5*4)
#print(2*3*2)
#print(a*3*a)
#print(8/4)
# 計算の順番(じゅんばん)が大事(だいじ)！
#print(a+b*a+b)


# 問題
# この違いわかる？
# kazu = 2
# moji = "2"
#print(kazu*5)
#print(moji*5)
# ↑↑↑の#を消してみよう！
# *はかけざんの記号
# どちらも２に５をかけてるけど、全然違う結果になるよ


# 問題
# これはどうなる？
kore = 10
#print(kore*5)
#print("kore"*5)


# 問題
# 多分わかる！
# 下の変数を使って高橋先生素敵を１０００回表示させてください
amazing_takahashi = "高橋先生素敵"


# れんしゅうしてみよう！D
# 変数を２つ（kinokoとtakenoko）を作ってみよう
# kinokoには自分のねんれいを入れてみよう
# takenokoには自分のねんれいを文字にしたものを入れてみよう
# print関数を使って、いろんな計算をしてみよう（ポイント５を見てね）
# ↓↓↓に答えを書いてみよう！



"""
変数の中身の更新(こうしん)
"""
a = 1
a = 10

b = "高橋"
b = "晴久"

# 変数の中身はいつでも変更(へんこう)することができる！

# 問題
# 下の変数の中身を変更してみよう！

anata_no_nenrei = 99
anata_no_namae = "ゴリ丸ゴリーン"


"""
変数の中身の更新(こうしん)
計算バージョン
"""
# 山田くんは貯金をしています
# 所持金は85円
# 問題
# 山田くんの所持金を変数に保存してください


# ある日山田くんはお風呂掃除を１０日連続でやったので
# お母さんからバイト代を２８７円もらいました
# 問題
# 山田くんの所持金を変更してください。



# 山田くんは大人気お菓子ゴキブリーんを買いました
# ゴキブリーんは８６円です
# 問題
# 山田くんの所持金を変更してください。


# お小遣いがもらえる日が来ました
# 山田くんのお小遣いはガチャです
# 山田くんのお小遣いの金額は毎回宝くじ形式です
# 1/100の確率でお小遣いが１０００円もらえます
# 10/100の確率でお小遣いが１円もらえます
# それ以外の場合はお小遣いが３００円もらえます
import random

# まずはrandomについて理解しよう！
# ヒント：0,100という数は何を表しているかな？
kazu = random.randint(0,100)




# 問題
# 山田くんはイケメン宝くじを買いました
# イケメン宝くじとは
# 1/10000の確率で高橋先生から100万円もらえる
# それ以外は高橋先生に300円をあげる
# という宝くじです
# このイケメン宝くじのプログラムを作ってちょんまげ
# ちなみにこの宝くじは実在しません

# 山田くんは宝くじを１枚書いました